Sway-Light/sway-light-ht32f52352/main.c
// mp3
u8 mp3CmdQueue[QUEUE_MAX_SIZE];
u8 queueSize = 0;

// esp8266
bool espFlag = FALSE, toEspFlag = FALSE;
bool errorFlag = FALSE;
u8 data_from_esp[10], data_to_esp[10];
u8 recieve_index = 0, send_index = 0;

/* Private variables ---------------------------------------------------------------------------------------*/
/* Global functions ----------------------------------------------------------------------------------------*/
/*********************************************************************************************************//**
  * @brief  Main program.
  * @retval None
  ***********************************************************************************************************/
int main(void) {
	NVIC_Configuration();               /* NVIC configuration                                                 */
	CKCU_Configuration();               /* System Related configuration                                       */
	GPIO_Configuration();               /* GPIO Related configuration                                         */
	RETARGET_Configuration();           /* Retarget Related configuration                                     */
	
	Light.slide = 61;
	Light.zoom = 6;
	Music.slide = 76;
	Music.zoom = 6;
	
	generateMusicColor(0x01); // high level
	generateMusicColor(0x02); // medium level
	generateMusicColor(0x03); // low level
	
	BFTM0_Configuration();
	
	ledInit(0);
	wsInit();
	
	speakerEnable(FALSE);
	
	GPTM1_Configuration();
	TM_Configuration();
	I2C_Configuration();
	ADC_Configuration();
	
	initFlag = TRUE;
	ADC_Cmd(HT_ADC0, ENABLE);
	TM_Cmd(HT_GPTM0, ENABLE);
	TM_Cmd(HT_GPTM1, ENABLE);
	
	/* ESP8266 Setup */
	espUART_Configuration();
	DataToESP(0x01, mode); 		// Sending Status Message
	while(toEspFlag == TRUE);	// Wait Until Data Transferred Complete
	DataToESP(0x02, 0x01); 		// Sending Initial Values of Color in Lighting Mode
	while(toEspFlag == TRUE);	// Wait Until Data Transferred Complete
	DataToESP(0x02, 0x05); 		// Sending Initial Values of Scale in Lighting Mode
	
	DefineRefBit();
	
	while (1) {
		if (realTime_flag == TRUE && Timestamp != 0) {
//			char buf[80];
			Timestamp += 1;
			
			ts = *localtime(&Timestamp);
			
//			strftime(buf, sizeof(buf), "%a %Y-%m-%d %H:%M:%S %Z", &ts);
//			printf("\r%s", buf);
			
			if (weekdayEN[ts.tm_wday - 1] == 1) {
				if (auto_OnOff[1] == 1 && mode != 0) {
					if (AutoOff.tm_hour == ts.tm_hour && AutoOff.tm_min == ts.tm_min && AutoOff.tm_sec == ts.tm_sec) {
						auto_OnOff[1] = 0;
						On_Effect(20, TRUE);
						mode = 0;
						if (toEspFlag != TRUE) DataToESP(0x01, mode); // Sending Power-Off Message
						speakerEnable(FALSE);
						
						DefineRefBit();
					}
				} else if (auto_OnOff[0] == 1 && mode == 0) {
					if (AutoOn.tm_hour == ts.tm_hour && AutoOn.tm_min == ts.tm_min && AutoOn.tm_sec == ts.tm_sec) {
						auto_OnOff[0] = 0;
						On_Effect(20, FALSE);
						mode = 3;
						mode = 1;
						if (toEspFlag != TRUE) DataToESP(0x01, mode); // Sending Power-On Message
						delay(1000);
						mode = 3;
						if (toEspFlag != TRUE) DataToESP(0x01, mode); // Sending Status Message
						adcIndex = 0;
						speakerEnable(TRUE);
					}
				}
			}
			
			realTime_flag = FALSE;
		}
		if (espFlag) {
			u8 i;
			u16 sum = 0, checksum = 0;
			
			for (i = 1; i < 7; i++) sum += data_from_esp[i];
			checksum = (data_from_esp[7] << 8) + data_from_esp[8];

//			printf("\r\n");
			if (!(data_from_esp[0] == 0x95)) {
//				printf("start byte Error\r\n");
				errorFlag = TRUE;
			}
			if (checksum == sum) {
				
				DataFromESP(data_from_esp);
				
//				for (i = 0; i < 9; i++) printf("0x%02X ", data_from_esp[i]);
//				printf("checksum Correct!\r\n");
			} else {
//				printf("checksum Error!\r\n");
			}
			espFlag = FALSE;
		}
		if (mBtAction == btClick) {
//			static bool flag = TRUE;
			mBtAction = btNone;
//			printf("click\r\n");
			
			if (mode == 2) {
				Switch_Effect(5, Light.slide);
				mode = 3;
				curr_mode = mode;
			} else if (mode == 3) {
				Switch_Effect(5, Music.slide);
				mode = 2;
				curr_mode = mode;
				adcIndex = 0;
			}
			if (toEspFlag != TRUE) DataToESP(0x01, mode); // Sending Status Message
			
			
			wsUpdateMag();
		} else if (mBtAction == btLongClick) {
			mBtAction = btNone;
//			printf("long click\r\n");
			
			if (mode != 0) {
				speakerEnable(FALSE);
				ref_bit = 0;
				On_Effect(20, TRUE);
				mode = 0;
				if (toEspFlag != TRUE) DataToESP(0x01, mode); // Sending Power-Off Message
				
				DefineRefBit();
				
//				printf("off\r\n");
			} else {
				On_Effect(20, FALSE);
				mode = 1;
				if (toEspFlag != TRUE) DataToESP(0x01, mode); // Sending Power-On Message
				delay(1000);
				mode = curr_mode;
				if (toEspFlag != TRUE) DataToESP(0x01, mode); // Sending Status Message
				
				if (mode == 3) adcIndex = 0;
				else wsUpdateMag();
				
				speakerEnable(TRUE);
				
//				printf("on\r\n");
			}
		}
		
		if (touchKeyDelayFlag) {
			if (!GPIO_ReadInBit(HT_GPIOC, GPIO_PIN_0)) {
				TK_CHECK = TRUE;
				Touch.Data = Touchkey_ButtonRead();
				get_TKLR();
//				printf("\rStatus = %d, DATA = %04X, slideValue = %3d, zoomValue = %3d", status, Touch.Data, Light.slide, Light.zoom);
				if (status == slide) {
//					Slide(TK_L, TK_R, &slideValue);
					if (mode == 2) Slide(TK_L, TK_R, &Light.slide);
					else if (mode == 3) Slide(TK_L, TK_R, &Music.slide);
					if (toEspFlag != TRUE) DataToESP(mode, 0x05); // Sending Brightness in Lighting Mode
				} else if (status == zoom) {
//					Zoom(TK_L, TK_R, &zoomValue);
					if (mode == 2) Zoom(TK_L, TK_R, &Light.zoom);
					else if (mode == 3) Zoom(TK_L, TK_R, &Music.zoom);
					if (toEspFlag != TRUE) DataToESP(mode, 0x05); // Sending Scale in Lighting Mode
				}
				
				wsUpdateMag();
				touchKeyDelayFlag = FALSE;
			} else {
				TK_CHECK = FALSE;
				TK_1SEC = TRUE;
				TK_COUNT = 0;
				status = none;
			}
		}
		
		if (mode == 3 || refFlag == TRUE) {
			ADC_MainRoutine();
			if (sampleFlag) {
				for (j = 0; j < TEST_LENGTH_SAMPLES; j += 1) fftData[j] = ((float)InputSignal[j]) / 2048.0;
				RUN_FFT();
				wsUpdateMag();
			}
		}
	}
}

/* Setup functions -----------------------------------------------------------------------------------------*/
void NVIC_Configuration(void) {
	/* Set the Vector Table base location at 0x00000000   */
	NVIC_SetVectorTable(NVIC_VECTTABLE_FLASH, 0x0);
}

void CKCU_Configuration(void) {
	#if 1
	CKCU_PeripClockConfig_TypeDef CKCUClock = {{ 0 }};
	CKCUClock.Bit.AFIO = 1;
	CKCU_PeripClockConfig(CKCUClock, ENABLE);
	#endif

	#if (ENABLE_CKOUT == 1)
	CKOUTConfig();
	#endif
}

